// Задание 1 "Управление библиотекой книг"

// Реализуйте класс Book, представляющий книгу, со следующими свойствами и методами:

// Свойство title (название) - строка, название книги.
// Свойство author (автор) - строка, имя автора книги.
// Свойство pages (количество страниц) - число, количество страниц в книге.
// Метод displayInfo() - выводит информацию о книге (название, автор и количество страниц).

// --------------------------------------------------------------------
console.log('--------------------------------------------------------------------');
console.log('Задание 1');
console.log('--------------------------------------------------------------------');

class Book {
  constructor(title = 'no name', author = 'no name', pages = 0) {
    this.title = title;
    this.author = author;
    this.pages = pages;
  }

  displayInfo() {
    console.log(`Информация о книге: 
    Название: ${this.title} 
    Автор: ${this.author} 
    Кол-во страниц: ${this.pages}`);
  }
}

const book = new Book('Дети капитана Гранта', 'Жюля Верн', 576);
const book1 = new Book();

book.displayInfo();
book1.displayInfo();

// --------------------------------------------------------------------
// Задание 2 "Управление списком студентов"

// Реализуйте класс Student, представляющий студента, со следующими свойствами и методами:

// Свойство name (имя) - строка, имя студента.
// Свойство age (возраст) - число, возраст студента.
// Свойство grade (класс) - строка, класс, в котором учится студент.
// Метод displayInfo() - выводит информацию о студенте (имя, возраст и класс).
// javascript

// --------------------------------------------------------------------
console.log('--------------------------------------------------------------------');
console.log('Задание 2');
console.log('--------------------------------------------------------------------');

class Student {
  constructor(name = 'no name', age = 0, grade = 'no group') {
    this.name = name;
    this.age = age;
    this.grade = grade;
  }

  displayInfo() {
    console.log(`Информация о студенте: 
    Имя: ${this.name} 
    Возраст: ${this.age} 
    Номер ученой группы: ${this.grade}`);
  }
}

const student = new Student('Dima', 28, '223-322');
const student1 = new Student();

student.displayInfo();
student1.displayInfo();

// --------------------------------------------------------------------
